# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "phrase/brewed"
tap "twilio/brew"

# Programming Languages
brew "go"              # The Go programming language
brew "lua"             # Lua 🌝
brew "luarocks"        # Package manager for the Lua programming language
brew "nvm"             # Node Version Manager
brew "node"            # Node.js (JavaScript runtime)

# Isolated Development Environments
brew "docker-compose"

# Development Tools
brew "gh"              # GitHub command-line tool
brew "git"             # Git version control system
brew "fd"              # Simple, fast and user-friendly alternative to find
brew "fzf"             # Command-line fuzzy finder written in Go
brew "gh"              # GitHub command-line tool
brew "gnu-sed"         # GNU implementation of the famous stream editor
brew "lazygit"         # Simple terminal UI for git commands
brew "neovim"          # Ambitious Vim-fork focused on extensibility and agility
brew "tree"            # Display directories as trees (with optional color/HTML output)

# Database Tools
brew "libpq"           # Postgres C API library
brew "postgresql@15"   # Object-relational database system
brew "redis"           # Persistent key-value database, with built-in net interface

# Search Tools
brew "ripgrep"         # Search tool like grep and The Silver Searcher

# ZSH Plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# API Interaction Tools
brew "phrase-cli"      # Tool to interact with the Phrase API
brew "twilio/brew/twilio" # Unleash the power of Twilio from your command prompt

# Cask Applications
cask "aerospace"       # AeroSpace is an i3-like tiling window manager for macOS
cask "visual-studio-code" # Visual Studio Code, a source-code editor
cask "zed"             # Zed is a modern, keyboard-centric text editor
